testapp/app/controllers/casyusers_controller.rb

  def index
    @casyusers = Casyuser.all
---
SELECT "casyusers".* FROM "casyusers"

  def create
    @casyuser = Casyuser.new(casyuser_params)

    respond_to do |format|
      if @casyuser.save
---
INSERT INTO "casyusers" ("name", "userid", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "aaa"], ["userid", 11], ["created_at", "2015-07-24 04:30:14.091866"], ["updated_at", "2015-07-24 04:30:14.091866"]]

    def set_casyuser
      @casyuser = Casyuser.find(params[:id])
---
SELECT  "casyusers".* FROM "casyusers" WHERE "casyusers"."id" = ? LIMIT 1  [["id", 1]]